In [1]:
import numpy as np
import pandas as pd

In [2]:
news = pd.read_excel('TwitterUserDesc.xlsx',sheet_name='Sheet1')

In [3]:
news.head()

,id,name,description,Type
0,0,jugjugantor24,0,News
1,1,dailystarnews,Bangladesh's largest English Daily. The latest...,News
2,2,parvenbd,"Aeronautical Engineer, Mentor(Rutgers State Un...",News
3,3,barta24bd,https://t.co/LrD6OpHQlK is a digital news mult...,News
4,4,TheDailyInqilab,Newspaper,News

In [4]:
len(news)

7480

In [5]:
news = news[:1070]

In [6]:
news

,id,name,description,Type
0,0,jugjugantor24,0,News
1,1,dailystarnews,Bangladesh's largest English Daily. The latest...,News
2,2,parvenbd,"Aeronautical Engineer, Mentor(Rutgers State Un...",News
3,3,barta24bd,https://t.co/LrD6OpHQlK is a digital news mult...,News
4,4,TheDailyInqilab,Newspaper,News
...,...,...,...,...
1065,1065,ChannelKhulna,Channel Khulna is a community based channel in...,NaN
1066,1066,newscamp24,https://t.co/nEqwINKhAC is a Online base bangl...,News
1067,1067,ShishirBaul,Gold Medalist at music and Singer & Musician a...,NaN
1068,1068,tpmhumanrights,Secretary Email- sanjibkanjilal1982@gmail.com ...,NaN
1069,1069,Crof,Retired college teacher & persistent writer (j...,NaN

In [10]:
name = list(news['name'])
Type = list(news['Type'])
desc = list(news['description'])

In [35]:
for i in range(len(news)):
    if 'news' in name[i] or 'news' in str(desc[i]) or 'barta' in name[i] or 'barta' in str(desc[i]) :
        Type[i] = 'News'

In [36]:
news['Type'] = Type

In [37]:
news.to_excel('news.xlsx')

In [28]:
'news' in name[3] or 'news' in desc[3]

True

In [5]:
a = 'rjmaude	1073,ParveenSilvia	1085,AFP	1090,CDCtravel	1121,sourav4tweet	1219,KPSouthsubnDiv	1222,BDTUBloodBank	1235,Lakshmipur_Dist	1375,'

b = 'shameemsayedee	1424,Rezwanulbsl	1480,CricketNDTV	1540,institutpasteur	1556,saberhc	1590,ajplus	1601,albd1971	1608,'

c = 'PDChina	1612,the_hindu	1617,AmdadNoman	1864,Osman__R_______	2065,BDTUser	2108,SohelAriyann	2180,SohagSaifur	2269,'

d = 'amiaAkter00	2275,Sobuz___	2465,Rpartho94	2513,montahajahan	2542,Tahsin_1357	2559,bodmasc	2602,Moriom29596828	2710,'

e = 'DebjaniBhatta20	2727,Yunus_Centre	2748,legion__group	2882,XHNews	2942,VOANews	3004,FightingMalaria	3039,CP24	3046,'

f = 'Asiablog_it	3058,NatashaFatah	3059,trunilss	3099,ifrc	3130,AFPSouthAsia	3206,WHOSEARO	3230,RT_com	3262,CGTNOfficial	3303,'

g = 'babyforeiign	3336,Omar_Akbari_	3389,INCWestBengal	3715,bmouBJP	4292,learnerpritom	4357,Faisalnaifaru	4482,Farhana_Rahi	5266,'

h = 'dalim1975	5288,MAarafat71	5540,sheuly_jahan	5927,tarique_arhaum	6611,hasanurrahmant2	7374'

In [6]:
haha = a+b+c+d+e+f+g+h

In [7]:
haha = haha.split(',')

In [8]:
a,b = map(list, zip(*[i.split('\t') for i in haha]))

In [9]:
b = [int(i) for i in b]

In [10]:
c = [0 for i in range(len(a))]

In [11]:
d = [0 for i in range(len(a))]

In [12]:
news2 = pd.DataFrame(list(zip(b,a,c,d)),columns=news.columns)

In [13]:
news = pd.read_excel('news.xlsx')

In [14]:
news.drop('Unnamed: 0',axis=1,inplace=True)

In [15]:
news = pd.concat([news,news2])

In [16]:
news.index = [i for i in range(len(news))]

In [17]:
news

,id,name,description,Type
0,0,jugjugantor24,0,News
1,1,dailystarnews,Bangladesh's largest English Daily. The latest...,News
2,2,parvenbd,"Aeronautical Engineer, Mentor(Rutgers State Un...",News
3,3,barta24bd,https://t.co/LrD6OpHQlK is a digital news mult...,News
4,4,TheDailyInqilab,Newspaper,News
...,...,...,...,...
1121,5288,dalim1975,51,51
1122,5540,MAarafat71,52,52
1123,5927,sheuly_jahan,53,53
1124,6611,tarique_arhaum,54,54
1125,7374,hasanurrahmant2,55,55

In [18]:
news.to_excel('news_v2.xlsx')